/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**                                      
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               firmware.h
** Latest modified Date:    2008-1-17
** Latest Version:          1.0
** Descriptions:            固件接口
**
**--------------------------------------------------------------------------------------------------------
** Created by:              Chenmingji
** Created date:            2008-1-17
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __FIRMWARE_H 
#define __FIRMWARE_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */

/*********************************************************************************************************
  通用宏定义
*********************************************************************************************************/
#ifndef TRUE
#define TRUE     1ul
#endif                                                                  /*  TRUE                        */

#ifndef FALSE
#define FALSE    0ul
#endif                                                                  /*  FALSE                       */

#ifndef NULL
#define NULL     0ul
#endif                                                                  /*  NULL                        */

/*********************************************************************************************************
  定义与编译器无关的数据类型
*********************************************************************************************************/
typedef unsigned char  BOOLEAN;                                         /*  布尔变量                    */
typedef unsigned char  INT8U;                                           /*  无符号8位整型变量           */
typedef signed   char  INT8S;                                           /*  有符号8位整型变量           */
typedef unsigned short INT16U;                                          /*  无符号16位整型变量          */
typedef signed   short INT16S;                                          /*  有符号16位整型变量          */
typedef unsigned long  INT32U;                                          /*  无符号32位整型变量          */
typedef signed   long  INT32S;                                          /*  有符号32位整型变量          */
typedef float          FP32;                                            /*  单精度浮点数（32位长度）    */
typedef double         FP64;                                            /*  双精度浮点数（64位长度）    */

typedef unsigned long  uint32;                                          /*  无符号32位整型变量          */
typedef signed   long  int32s;                                          /*  有符号32位整型变量          */
typedef unsigned short uint16;                                          /*  无符号16位整型变量          */
typedef unsigned char  uint8;                                           /*  无符号8位整型变量           */
/*********************************************************************************************************
  realView编译器需要添加的头文件
*********************************************************************************************************/
#include    <ctype.h>
#include    <stdlib.h>
#include    <setjmp.h>
#include    <rt_misc.h>

/*********************************************************************************************************
  固件提供的功能引入的头文件
*********************************************************************************************************/
#include    ".\Startup\lpc1100.h"
#include    ".\Startup\target.h"
#include    ".\zy_if\zy_if.h"

/*********************************************************************************************************
  其它需要引入的头文件
*********************************************************************************************************/

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __FIRMWARE_H                */
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
