/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           config.h
** Last modified Date:  2009-05-15
** Last Version:        V1.01
** Descriptions:        User Configurable File
**
**--------------------------------------------------------------------------------------------------------
** Created By:          LinEnqiang
** Created date:        2009-06-12
** Version:             V1.00
** Descriptions:        First version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:        
** Modified date:      
** Version:            
** Descriptions:       
**
*********************************************************************************************************/
#ifndef __CONFIG_H 
#define __CONFIG_H

#ifdef __cplusplus
extern "C" {
#endif                                                                  /*  __cplusplus                 */
  
/*********************************************************************************************************
  固件的特殊代码, 这一段无需改动
*********************************************************************************************************/
#include ".\ZY_CODE\firmware.h"

/*********************************************************************************************************
  配置代码定义
*********************************************************************************************************/
#include ".\cfg_file\target_cfg.h"
#include ".\cfg_file\Startup\LPC1100PinCfg.h"

/*********************************************************************************************************
  在下面用户可以添加自己的配置
*********************************************************************************************************/
#include    <stdio.h>

#define SET_GPIO_syb_n_bit_value(syb,n,value)   GPIO##n##syb =   (value);

#define SET_GPIO_syb_n_bit_0(syb,n,bit)         GPIO##n##syb &= ~(1<<bit);
#define SET_GPIO_syb_n_bit_1(syb,n,bit)         GPIO##n##syb |=  (1<<bit);

#define IS_GPIO_syb_n_bit_1(syb,n,bit)  ((GPIO##n##syb & (1<<bit)) == (1<<bit))
#define IS_GPIO_syb_n_bit_0(syb,n,bit)  ((GPIO##n##syb & (1<<bit)) != (1<<bit))

#define LED_ON(x,y)     GPIO##x##DIR  |= (1<<y);GPIO##x##DATA &= ~(1<<y); 
#define LED_OFF(x,y)    GPIO##x##DIR  |= (1<<y);GPIO##x##DATA |= (1<<y); 

#define  UART_BPS    19200                                             /*  串口通信波特率              */

#ifdef __cplusplus
}
#endif                                                                  /*  __cplusplus                 */

#endif                                                                  /*  __CONFIG_H                  */

/*********************************************************************************************************
  End File
*********************************************************************************************************/
